{
  "main": {
    "name": "Usanase Didier",
    "description": "I am a full-stack software developer and I use Javascript and Java to develop softwares. This is my portfolio, feel free to reach out to me whether it's for a short time or for a long term projects",
    "image": "Diddy-modified.png",
    "bio": "I am an athlete at heart, with an entrepreneurial spirit, a knack for online security, and a passion for coding. Born and raised in Rwanda where I work as a full stack developer for BlueApps, alongside my many ongoing projects. I love to create and tend to keep a few too many projects on the go at a time. Outside of work I am an avid gamer; PlayStation,billard,kicker, igisoro, amatatu, amaturufu, foot ball and basketball player. I love to travel and lead a fairly nomadic lifestyle. I built much of my early portfolio from the streets of Kigali and dream of being able to take my work with me while travelling the world.",
    "contactmessage": "Here is where you should write your message to readers to have them get in contact with you.",
    "email": "todiddy20@gmail.com",
    "github": "https://github.com/UsanaseD",
    "project": "https://github.com/nordicgiant2/react-nice-resume",
    "address": {
      "city": "Kigali",
      "state": "Rwanda"
    },
    "website": "http://www.timbakerdev.com",
    "resumedownload": "https://drive.google.com/file/d/1ZK0ds_i2Zdl0DxMm7esZvpjcCCu18ZUS/view?usp=sharing",
    "social": [
      {
        "name": "gitlab",
        "url": "https://gitlab.com/UsanaseD",
        "className": "fa fa-gitlab"
      },
      {
        "name": "twitter",
        "url": "https://twitter.com/Usaanase",
        "className": "fa fa-twitter"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/didier-usanase-25a008103/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/UsanaseD",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "Here are my skills ratings",
    "education": [
      {
        "school": "University?",
        "degree": "Bachelor's degree in IT/Networking",
        "graduated": "April 2016",
        "description": " courses were designed to provide students with a working knowledge of computer concepts and essential skills necessary for work and communication in today's society.I learnt safety, security, and ethical issues in computing and social networking. I also learnt about input/output systems, computer hardware and operating systems. I worked with an integrated office software suite called Microsoft Office. I learnt intermediate Word Processing (Word), Presentation (PowerPoint), and Spreadsheet (Excel) skills.  I learnt the basics of Database Management Systems (MySql) as well as Personal Information Management software (Outlook).  I was also introduced to desktop publishing (Publisher), and video editing software (Movie Maker). I was also introduced to digital animation, 3D Design, and programming."
      }
    ],
    "work": [
      {
        "company": "MEGASOFT RWANDA",
        "title": "Chief Technology Officer",
        "years": "Jan 2017 – Jan 2019",
        "description": "Implemented DevOps technology to be used on the project, Implement Dev environment and Supervised the implementation of both front-end and back-end , Coded the payment feature by calling in Flutterwave API on the back-end and integrated it with the designed UI, Performed integration testing as well as unit testing on all features on the back-end using Mocha framework and Chai Library, Tested all features on the front-end using Jest framework, Language-used: JavaScript (Node-Express),JavaScript (ReactJs), DBMS-used:PostGres, CI/CD-used:GitLab & docker,Project-Management: Pivotal Tracker, Third-Party for serverless: Firebase"
      },
      {
        "company": "AwesomityLab",
        "title": "Software Development Trainee and full stack Software Developer",
        "years": "January 2020 – April-2020",
        "description": "Scrum Master, Developed analytics and history features on both backend and frontend, Performed integration testing as well as unit testing on the back-end using @SpringBootTest, Tested all features on the front-end using Jest framework,Language-used: Java (Spring-boot),JavaScript (ReactJs), DBMS-used:PostGres, CI/CD-used:GitLab & docker, Project-Management: Jira"
      },
      {
        "company": "Freelancing",
        "title": " full stack Software Developer",
        "description": "Developed all features on the backend in Java using Spring-boot, Developed and integrated chart and feeds features on the frontend, Performed integration testing as well as unit testing on the back-end using@SpringBootTest, Tested all features on the front-end using Jest framework, Language-used: Java (Spring-Boot),JavaScript (ReactJs), DBMS-used:PostGres, CI/CD-used:GitLab & docker, Project-Management: Jira"
      }
    ],
    "skills": [
      {
        "name": "SpringBoot",
        "level": "60%"
      },
      {
        "name": "ReactJs",
        "level": "85%"
      },
      {
        "name": "ReactNative",
        "level": "80%"
      },
      {
        "name": "CSS",
        "level": "90%"
      },
      {
        "name": "NodeJs",
        "level": "80%"
      },
      {
        "name": "AWS Amplify",
        "level": "80%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Biko",
        "category": "Biko is an online stock management Application that My Travel Blog for my post-university travels records analyse and predict the future on your inventor",
        "image": "Capture.PNG",
        "url": "https://www.canadianwanderlust.com"
      },
      {
        "title": "LGS",
        "category": "Local Government System (LGS) is a solution that will help enhance the local government procedures by producing a system that efficiently used in collecting & analyzing data  to produce useful insights ",
        "image": "Lgs.png",
        "url": "http://www.timbakerdev.com"
      },
      {
        "title": "CoviTrack",
        "category": "CoviTrack is a platform that keep the ocal communities updated about the Novel Corona Virus",
        "image": "covitrack.png",
        "url": "http://www.timbakerdev.com"
      },
      {
        "title": "Ashara",
        "category": "A market place that links buyers, retailers and deliverers",
        "image": "ash.png",
        "url": "http://www.smirkspace.com"
      }
    ]
  }
}
